export const howToUse = [
	{
		title: "このアプリでできること",
		content: [
			"このアプリでは、特徴の似ている画像をうまく対応させて重ねて見ることができます。",
			"これまではPhotoShopやGIMPなどのアプリを開いて難しい手順を踏まなければできなかった作業をブラウザの中だけで実現できます。",
		],
	},
	{
		title: "このアプリの使い方",
		content: [
			"まず、比較をしたい画像を用意します。対応しているファイルタイプはjpegとpngです。",
			"つぎに、それらファイルを読み込みます。",
			"画像の読み込みが完了すると、読み込んだ画像をマウスで動かしたり拡大縮小できる画面が現れます。",
			"この画面では、2つの画像を一致させるために必要な操作を行ないます。",
			"それぞれの画面の中央に、数字のついたマーカーが用意されています。これらを動かして、右と左とで同じ番号のマーカーが同じポイントを押さえるようにマーカーの位置を調整して下さい。",
			"マーカーの位置合わせが終わったら、次は画像処理の作業に移ります。",
			"「処理を実行」ボタンを押すと、左画面に映っていた画像が、左側の画像にフィットするように変形作業が実行されます。",
			"ボタンを押すと処理は自動的に進行し、処理が終わると画像の比較閲覧画面が表示されます。",
			"デフォルトはレイヤー表示ですが、トグルスイッチをいじると、二画面モードにも変更できます。",
			"うまく画像が合っていないというときは、対応点の位置合わせがうまく行っていない可能性があります。「始めに戻る」ボタンを押して最初からやり直して下さい。",
		],
	},
];
